public class DataExamples {
    //данные для нормализации характеристик [мин. знач, макс. знач]
    private static int[][] NORMALIZE_DATA = new int[][]{
            /*0. количество ног*/   {0, 4},
            /*1. тип рождения*/     {1, 3}, //1 - икра, 2 - живородящие, 3 - яйца
            /*2. сложная НС*/       {0, 1},
            /*3. температура тела*/ {10, 45},
            /*4. подводное дыхание*/{0, 1},
            /*5. волосяной покров*/ {1, 3}, //1 - перья, 2 - чешуя, 3 - волосы
            /*6. может летать*/     {0, 1},
            /*7. среда обитания*/   {1, 3}, //1 - земля, 2- вода, 3 - земля и вода
            /*8. выделение яда*/    {0, 1},
            /*9. кормит молоком*/   {0, 1},
    };

    private static String[][] EXAMPLE = new String[][]{
            //рыбы
            /*0. щука*/     {"0", "икра", "0", "13", "1", "чешуя", "0", "вода", "0", "0"},
            /*1. стерлядь*/ {"0", "икра", "0", "15", "1", "чешуя", "0", "вода", "1", "0"},
            /*2. минтай*/   {"0", "икра", "0", "12", "1", "чешуя", "0", "вода", "0", "0"},
            /*3. форель*/   {"0", "икра", "0", "13", "1", "чешуя", "0", "вода", "0", "0"},
            /*4. семга*/    {"0", "икра", "0", "13", "1", "чешуя", "0", "вода", "0", "0"},
            /*5. килька*/   {"0", "икра", "0", "16", "1", "чешуя", "0", "вода", "0", "0"},
            //земноводные
            /*6. тритон*/   {"4", "икра", "0", "21", "1", "чешуя", "0", "земля и вода", "1", "0"},
            /*7.саламандра*/{"4", "икра", "0", "20", "1", "чешуя", "0", "земля и вода", "1", "0"},
            /*8. лягушка*/  {"4", "икра", "0", "19", "1", "чешуя", "0", "земля и вода", "1", "0"},
            /*9.чесночница*/{"4", "икра", "0", "17", "1", "чешуя", "0", "земля и вода", "1", "0"},
            /*10. жаба*/    {"4", "икра", "0", "20", "1", "чешуя", "0", "земля и вода", "1", "0"},
            /*11. червяга*/ {"0", "икра", "0", "19", "0", "чешуя", "0", "земля и вода", "1", "0"},
            //рептилии
            /*12. крокодил*/{"4", "яйца", "0", "15", "1", "чешуя", "0", "земля и вода", "0", "0"},
            /*13. черепаха*/{"4", "яйца", "0", "18", "1", "чешуя", "0", "земля и вода", "0", "0"},
            /*14. ящерица*/ {"4", "яйца", "0", "20", "0", "чешуя", "0", "земля", "1", "0"},
            /*15. игуана*/  {"4", "яйца", "0", "20", "0", "чешуя", "0", "земля", "1", "0"},
            /*16. хамелеон*/{"4", "яйца", "0", "23", "0", "чешуя", "0", "земля", "1", "0"},
            /*17. динозавр*/{"2", "яйца", "0", "23", "0", "чешуя", "0", "земля", "0", "0"},
            //млекопитающие
            /*18. медведь*/ {"4", "живородящие", "1", "37", "0", "волосы", "0", "земля", "0", "1"},
            /*19. гиена*/   {"4", "живородящие", "1", "38", "0", "волосы", "0", "земля", "0", "1"},
            /*20. рысь*/    {"4", "живородящие", "1", "37", "0", "волосы", "0", "земля", "0", "1"},
            /*21. бобер*/   {"4", "живородящие", "1", "36", "0", "волосы", "0", "земля и вода", "0", "1"},
            /*22. еж*/      {"4", "живородящие", "1", "35", "0", "волосы", "0", "земля", "0", "1"},
            /*23. заяц*/    {"4", "живородящие", "1", "36", "0", "волосы", "0", "земля", "0", "1"},
            //птицы
            /*24. воробей*/ {"2", "яйца", "1", "42", "0", "перья", "1", "земля", "0", "0"},
            /*25. гусь*/    {"2", "яйца", "1", "43", "0", "перья", "1", "земля", "0", "0"},
            /*26. страус*/  {"2", "яйца", "1", "45", "0", "перья", "0", "земля", "0", "0"},
            /*27. орел*/    {"2", "яйца", "1", "44", "0", "перья", "1", "земля", "0", "0"},
            /*28. пеликан*/ {"2", "яйца", "1", "45", "0", "перья", "1", "земля", "0", "0"},
            /*29. попугай*/ {"2", "яйца", "1", "40", "0", "перья", "1", "земля", "0", "0"}
    };



    public static int[][] getNormalizeData(){
        return NORMALIZE_DATA;
    }

    public static int[][] getExamples(){
        return EXAMPLES;
    }

    private static int[][] EXAMPLES = new int[][]{
            //рыбы
            /*0. щука*/     {0, 1, 0, 13, 1, 2, 0, 2, 0, 0},
            /*1. стерлядь*/ {0, 1, 0, 15, 1, 2, 0, 2, 1, 0},
            /*2. минтай*/   {0, 1, 0, 12, 1, 2, 0, 2, 0, 0},
            /*3. форель*/   {0, 1, 0, 13, 1, 2, 0, 2, 0, 0},
            /*4. семга*/    {0, 1, 0, 13, 1, 2, 0, 2, 0, 0},
            /*5. килька*/   {0, 1, 0, 16, 1, 2, 0, 2, 0, 0},
            //земноводные
            /*6. тритон*/   {4, 1, 0, 21, 1, 2, 0, 3, 1, 0},
            /*7.саламандра*/{4, 1, 0, 20, 1, 2, 0, 3, 1, 0},
            /*8. лягушка*/  {4, 1, 0, 19, 1, 2, 0, 3, 1, 0},
            /*9.чесночница*/{4, 1, 0, 17, 1, 2, 0, 3, 1, 0},
            /*10. жаба*/    {4, 1, 0, 20, 1, 2, 0, 3, 1, 0},
            /*11. червяга*/ {0, 1, 0, 19, 0, 2, 0, 3, 1, 0},
            //рептилии
            /*12. крокодил*/{4, 3, 0, 15, 1, 2, 0, 3, 0, 0},
            /*13. черепаха*/{4, 3, 0, 18, 1, 2, 0, 3, 0, 0},
            /*14. ящерица*/ {4, 3, 0, 20, 0, 2, 0, 1, 1, 0},
            /*15. игуана*/  {4, 3, 0, 20, 0, 2, 0, 1, 1, 0},
            /*16. хамелеон*/{4, 3, 0, 23, 0, 2, 0, 1, 1, 0},
            /*17. динозавр*/{2, 3, 0, 23, 0, 2, 0, 1, 0, 0},
            //млекопитающие
            /*18. медведь*/ {4, 2, 1, 37, 0, 3, 0, 1, 0, 1},
            /*19. гиена*/   {4, 2, 1, 38, 0, 3, 0, 1, 0, 1},
            /*20. рысь*/    {4, 2, 1, 37, 0, 3, 0, 1, 0, 1},
            /*21. бобер*/   {4, 2, 1, 36, 0, 3, 0, 3, 0, 1},
            /*22. еж*/      {4, 2, 1, 35, 0, 3, 0, 1, 0, 1},
            /*23. заяц*/    {4, 2, 1, 36, 0, 3, 0, 1, 0, 1},
            //птицы
            /*24. воробей*/ {2, 3, 1, 42, 0, 1, 1, 1, 0, 0},
            /*25. гусь*/    {2, 3, 1, 43, 0, 1, 1, 1, 0, 0},
            /*26. страус*/  {2, 3, 1, 45, 0, 1, 0, 1, 0, 0},
            /*27. орел*/    {2, 3, 1, 44, 0, 1, 1, 1, 0, 0},
            /*28. пеликан*/ {2, 3, 1, 45, 0, 1, 1, 1, 0, 0},
            /*29. попугай*/ {2, 3, 1, 40, 0, 1, 1, 1, 0, 0}
    };
}
